package com.tencent;

public class _0_Total {

    /**
     * 数据结构、算法题：
     * 1、N个人中至少两个人同一天生日的概率
     * 2、整数数组中找出前边的数都比自己小，后边的数都比自己大的数
     * 3、字符串串去空格
     * 4、手写链表反转函数，要求是不用其他辅助的存储
     * 5、二叉树的遍历
     * 6、计算二叉树高度
     * 7、字符串转整形
     * 8、写一个lru算法
     * 9、手写算法 ：多文件内容排序，求根号算法
     * 10、排序 时间复杂度
     * 11、红黑树、二叉树、冒泡排序、快速排序
     * 12、给定一个有序的旋转数组，查找某个元素是否在数组内，eg： ［4 5 6 1 2 3］target=5
     * 13、 给定一个物品在各个时间点的价格，求进行一次买卖之后最大获利。
     * 变形为：求多次买卖的最大获利
     * 14、 设计一个最优时空复杂度的位循环队列
     * 15、实现一个LRU
     * 16、系统为某进程分配了4个页框，该进程已访问的页号序列为2,0,2,9,3,4,2,8,2,4,8,4,5。若进程要访问的下一页的页号为7，依据LRU算法，应淘汰页的页号是几号？
     * 17、手写深拷贝实现代码
     * 18、哈夫曼编码
     * 19、有序数组，相同的元素最多保留2个，O(1)的算法
     * 20、手写代码，求链表倒数第k个元素
     * 21.手写代码，求数组中出现次数超过一般的数
     * 22. 有一个随机数生成器，能以p概率生成0，1-p概率生成1。利用这个生成器等概率生成0-6。
     * 23. 在32gb的内存里对1tb数据排序
     * 24. 简单动态规划，爬楼梯问题
     * 25、最长公共子序列
     * 26、二维数组，回字型输出
     * 27、一个数组，和sum，求出数组中所有可能的任意元素（一个元素只能用一次）的和等于sum的组合。
     * 28、柱状图求最大矩形面积
     * 29、大整数字串相乘
     * 30、N*N地图随机放X个雷，打印地图，每格显示周边雷的个数
     * 31、- x的N次方最优解
     * 32、- 栈与队列的区别 如何用栈实现队列 如果要求时间、空间复杂度都是O(1)
     * 33、- 送礼动画如何实现的
     * 34、- 死锁
     *
     */
    public static void main(String[] args) {

    }
}
